tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf27k40_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF27K40_H_
#define _PIC18LF27K40_H_

#define RX2PPS                        0
#define RX2PPS_RXPPS                  1
#define TX2PPS                        2
#define TX2PPS_TXPPS                  3
#define SSP2CLKPPS                    4
#define SSP2CLKPPS_SSPCLKPPS          5
#define SSP2DATPPS                    6
#define SSP2DATPPS_SSPDATPPS          7
#define SSP2SSPPS                     8
#define SSP2SSPPS_SSPSSPPS            9
#define SSP2BUF                       10
#define SSP2BUF_SSPBUF                11
#define SSP2ADD                       12
#define MSK02                         13
#define SSP2ADD_SSPADD                14
#define MSK12                         15
#define MSK22                         16
#define MSK32                         17
#define MSK42                         18
#define MSK52                         19
#define MSK62                         20
#define MSK72                         21
#define SSP2MSK                       22
#define SSP2MSK_SSPMSK                23
#define SSP2MSK_MSK0                  24
#define SSP2MSK_MSK1                  25
#define SSP2MSK_MSK2                  26
#define SSP2MSK_MSK3                  27
#define SSP2MSK_MSK4                  28
#define SSP2MSK_MSK5                  29
#define SSP2MSK_MSK6                  30
#define SSP2MSK_MSK7                  31
#define SSP2STAT                      32
#define SSP2STAT_BF                   33
#define BF2                           34
#define SSP2STAT_UA                   35
#define UA2                           36
#define SSP2STAT_R_W                  37
#define RW2                           38
#define SSP2STAT_nWRITE               39
#define SSP2STAT_nW                   40
#define READ_WRITE2                   41
#define nW2                           42
#define SSP2STAT_I2C_READ             43
#define I2C_READ2                     44
#define SSP2STAT_R_NOT_W              45
#define R_nW2                         46
#define SSP2STAT_READ_WRITE           47
#define nWRITE2                       48
#define R_W2                          49
#define SSP2STAT_R_nW                 50
#define SSP2STAT_NOT_WRITE            51
#define SSP2STAT_S                    52
#define S2                            53
#define START2                        54
#define SSP2STAT_I2C_START            55
#define I2C_START2                    56
#define P2                            57
#define SSP2STAT_I2C_STOP             58
#define STOP2                         59
#define SSP2STAT_P                    60
#define I2C_STOP2                     61
#define I2C_DAT2                      62
#define DATA_ADDRESS2                 63
#define SSP2STAT_D_NOT_A              64
#define SSP2STAT_I2C_DAT              65
#define D_A2                          66
#define SSP2STAT_NOT_ADDRESS          67
#define SSP2STAT_D_nA                 68
#define SSP2STAT_DATA_ADDRESS         69
#define SSP2STAT_nADDRESS             70
#define nA2                           71
#define DA2                           72
#define nADDRESS2                     73
#define SSP2STAT_nA                   74
#define SSP2STAT_D_A                  75
#define D_nA2                         76
#define SSP2STAT_CKE                  77
#define CKE2                          78
#define SSP2STAT_SMP                  79
#define SMP2                          80
#define SSP2CON1                      81
#define SSP2CON1_SSPM                 82
#define SSP2CON1_SSPM0                83
#define SSPM02                        84
#define SSPM12                        85
#define SSP2CON1_SSPM1                86
#define SSP2CON1_SSPM2                87
#define SSPM22                        88
#define SSPM32                        89
#define SSP2CON1_SSPM3                90
#define SSP2CON1_CKP                  91
#define CKP2                          92
#define SSPEN2                        93
#define SSP2CON1_SSPEN                94
#define SSPOV2                        95
#define SSP2CON1_SSPOV                96
#define WCOL2                         97
#define SSP2CON1_WCOL                 98
#define SSP2CON2                      99
#define SEN2                          100
#define SSP2CON2_SEN                  101
#define ADMSK12                       102
#define SSP2CON2_ADMSK                103
#define SSP2CON2_RSEN                 104
#define RSEN2                         105
#define SSP2CON2_ADMSK1               106
#define ADMSK22                       107
#define PEN2                          108
#define SSP2CON2_PEN                  109
#define SSP2CON2_ADMSK2               110
#define ADMSK32                       111
#define SSP2CON2_RCEN                 112
#define RCEN2                         113
#define SSP2CON2_ADMSK3               114
#define ACKEN2                        115
#define ADMSK42                       116
#define SSP2CON2_ADMSK4               117
#define SSP2CON2_ACKEN                118
#define ACKDT2                        119
#define ADMSK52                       120
#define SSP2CON2_ACKDT                121
#define SSP2CON2_ADMSK5               122
#define SSP2CON2_ACKSTAT              123
#define ACKSTAT2                      124
#define SSP2CON2_GCEN                 125
#define GCEN2                         126
#define SSP2CON3                      127
#define SSP2CON3_DHEN                 128
#define SSP2CON3_AHEN                 129
#define SSP2CON3_SBCDE                130
#define SSP2CON3_SDAHT                131
#define SSP2CON3_BOEN                 132
#define SSP2CON3_SCIE                 133
#define SSP2CON3_PCIE                 134
#define SSP2CON3_ACKTIM               135
#define RC2REG                        136
#define TX2REG                        137
#define SP2BRGL                       138
#define SP2BRGH                       139
#define RC2STA                        140
#define RC2STA_RX9D                   141
#define RCD82                         142
#define RC2STA_OERR                   143
#define RC2STA_FERR                   144
#define RC2STA_ADDEN                  145
#define RC2STA_CREN                   146
#define RC2STA_SREN                   147
#define RC92                          148
#define RC2STA_RX9                    149
#define RC8_92                        150
#define RC2STA_SPEN                   151
#define TX2STA                        152
#define TX2STA_TX9D                   153
#define TXD82                         154
#define TX2STA_TRMT                   155
#define TX2STA_BRGH                   156
#define TX2STA_SENDB                  157
#define TX2STA_SYNC                   158
#define TX2STA_TXEN                   159
#define TX8_92                        160
#define TX2STA_TX9                    161
#define TX2STA_CSRC                   162
#define BAUD2CON                      163
#define BAUD2CON_ABDEN                164
#define ABDEN2                        165
#define WUE2                          166
#define BAUD2CON_WUE                  167
#define BRG162                        168
#define BAUD2CON_BRG16                169
#define SCKP2                         170
#define BAUD2CON_SCKP                 171
#define TXCKP2                        172
#define BAUD2CON_RCIDL                173
#define RCMT2                         174
#define RCIDL2                        175
#define BAUD2CON_ABDOVF               176
#define ABDOVF2                       177
#define PPSLOCK                       178
#define PPSLOCKED                     179
#define INT0PPS0                      180
#define INT0PPS                       181
#define INT0PPS1                      182
#define INT0PPS2                      183
#define INT0PPS3                      184
#define INT0PPS4                      185
#define INT1PPS                       186
#define INT1PPS0                      187
#define INT1PPS1                      188
#define INT1PPS2                      189
#define INT1PPS3                      190
#define INT1PPS4                      191
#define INT2PPS0                      192
#define INT2PPS                       193
#define INT2PPS1                      194
#define INT2PPS2                      195
#define INT2PPS3                      196
#define INT2PPS4                      197
#define T0CKIPPS0                     198
#define T0CKIPPS                      199
#define T0CKIPPS1                     200
#define T0CKIPPS2                     201
#define T0CKIPPS3                     202
#define T0CKIPPS4                     203
#define T1CKIPPS0                     204
#define T1CKIPPS                      205
#define T1CKIPPS1                     206
#define T1CKIPPS2                     207
#define T1CKIPPS3                     208
#define T1CKIPPS4                     209
#define T1GPPS0                       210
#define T1GPPS                        211
#define T1GPPS1                       212
#define T1GPPS2                       213
#define T1GPPS3                       214
#define T1GPPS4                       215
#define T3CKIPPS0                     216
#define T3CKIPPS                      217
#define T3CKIPPS1                     218
#define T3CKIPPS2                     219
#define T3CKIPPS3                     220
#define T3CKIPPS4                     221
#define T3GPPS0                       222
#define T3GPPS                        223
#define T3GPPS1                       224
#define T3GPPS2                       225
#define T3GPPS3                       226
#define T3GPPS4                       227
#define T5CKIPPS0                     228
#define T5CKIPPS                      229
#define T5CKIPPS1                     230
#define T5CKIPPS2                     231
#define T5CKIPPS3                     232
#define T5CKIPPS4                     233
#define T5GPPS                        234
#define T5GPPS0                       235
#define T5GPPS1                       236
#define T5GPPS2                       237
#define T5GPPS3                       238
#define T5GPPS4                       239
#define T2INPPS                       240
#define T2INPPS0                      241
#define T2INPPS1                      242
#define T2INPPS2                      243
#define T2INPPS3                      244
#define T2INPPS4                      245
#define T4INPPS0                      246
#define T4INPPS                       247
#define T4INPPS1                      248
#define T4INPPS2                      249
#define T4INPPS3                      250
#define T4INPPS4                      251
#define T6INPPS0                      252
#define T6INPPS                       253
#define T6INPPS1                      254
#define T6INPPS2                      255
#define T6INPPS3                      256
#define T6INPPS4                      257
#define ADACTPPS                      258
#define ADACTPPS0                     259
#define ADACTPPS1                     260
#define ADACTPPS2                     261
#define ADACTPPS3                     262
#define ADACTPPS4                     263
#define CCP1PPS0                      264
#define CCP1PPS                       265
#define CCP1PPS1                      266
#define CCP1PPS2                      267
#define CCP1PPS3                      268
#define CCP1PPS4                      269
#define CCP2PPS0                      270
#define CCP2PPS                       271
#define CCP2PPS1                      272
#define CCP2PPS2                      273
#define CCP2PPS3                      274
#define CCP2PPS4                      275
#define CWGINPPS                      276
#define CWGINPPS0                     277
#define CWG1INPPS0                    278
#define CWG1INPPS                     279
#define CWGINPPS1                     280
#define CWG1INPPS1                    281
#define CWGINPPS2                     282
#define CWG1INPPS2                    283
#define CWGINPPS3                     284
#define CWG1INPPS3                    285
#define CWGINPPS4                     286
#define CWG1INPPS4                    287
#define MDCARLPPS                     288
#define MDCARLPPS0                    289
#define MDCARLPPS1                    290
#define MDCARLPPS2                    291
#define MDCARLPPS3                    292
#define MDCARLPPS4                    293
#define MDCARHPPS0                    294
#define MDCARHPPS                     295
#define MDCARHPPS1                    296
#define MDCARHPPS2                    297
#define MDCARHPPS3                    298
#define MDCARHPPS4                    299
#define MDSRCPPS0                     300
#define MDSRCPPS                      301
#define MDSRCPPS1                     302
#define MDSRCPPS2                     303
#define MDSRCPPS3                     304
#define MDSRCPPS4                     305
#define RX1PPS                        306
#define RX1PPS_RXPPS                  307
#define TX1PPS                        308
#define TX1PPS_TXPPS                  309
#define SSP1CLKPPS                    310
#define SSP1CLKPPS_SSPCLKPPS          311
#define SSP1DATPPS                    312
#define SSP1DATPPS_SSPDATPPS          313
#define SSP1SSPPS                     314
#define SSP1SSPPS_SSPSSPPS            315
#define IPR0                          316
#define INT0IP                        317
#define INT1IP                        318
#define INT2IP                        319
#define IOCIP                         320
#define TMR0IP                        321
#define IPR1                          322
#define ADIP                          323
#define ADTIP                         324
#define CSWIP                         325
#define OSCFIP                        326
#define PSPIP                         327
#define IPR2                          328
#define C1IP                          329
#define C2IP                          330
#define ZCDIP                         331
#define CMIP                          332
#define HLVDIP                        333
#define IPR3                          334
#define SSP1IP                        335
#define BCL1IP                        336
#define RXBNIP                        337
#define SSP2IP                        338
#define BCL2IP                        339
#define TX1IP                         340
#define TXBNIP                        341
#define RC1IP                         342
#define TX2IP                         343
#define RC2IP                         344
#define IPR4                          345
#define TMR1IP                        346
#define CCIP3IP                       347
#define TMR2IP                        348
#define TMR3IP                        349
#define TMR4IP                        350
#define TMR5IP                        351
#define TMR6IP                        352
#define IPR5                          353
#define TMR1GIP                       354
#define CCH05                         355
#define TMR3GIP                       356
#define CCH15                         357
#define TMR5GIP                       358
#define IPR6                          359
#define CCP1IP                        360
#define CCP2IP                        361
#define IPR7                          362
#define CWG1IP                        363
#define CWGIP                         364
#define NVMIP                         365
#define CRCIP                         366
#define SCANIP                        367
#define PIE0                          368
#define INT0IE                        369
#define INT1IE                        370
#define INT2IE                        371
#define IOCIE                         372
#define TMR0IE                        373
#define PIE1                          374
#define ADIE                          375
#define ADTIE                         376
#define CSWIE                         377
#define OSCFIE                        378
#define PSPIE                         379
#define PIE2                          380
#define C1IE                          381
#define C2IE                          382
#define ZCDIE                         383
#define CMIE                          384
#define HLVDIE                        385
#define PIE3                          386
#define SSP1IE                        387
#define RXB0IE                        388
#define BCL1IE                        389
#define RXBNIE                        390
#define RXB1IE                        391
#define SSP2IE                        392
#define TXB0IE                        393
#define BCL2IE                        394
#define TXB1IE                        395
#define TXBNIE                        396
#define TXB2IE                        397
#define TX1IE                         398
#define RC1IE                         399
#define TX2IE                         400
#define RC2IE                         401
#define PIE4                          402
#define TMR1IE                        403
#define TMR2IE                        404
#define TMR3IE                        405
#define TMR4IE                        406
#define TMR5IE                        407
#define TMR6IE                        408
#define PIE5                          409
#define TMR1GIE                       410
#define TMR3GIE                       411
#define TMR5GIE                       412
#define PIE6                          413
#define CCP1IE                        414
#define CCP2IE                        415
#define PIE7                          416
#define CWGIE                         417
#define CWG1IE                        418
#define NVMIE                         419
#define CRCIE                         420
#define SCANIE                        421
#define PIR0                          422
#define INT0IF                        423
#define INT1IF                        424
#define INT2IF                        425
#define IOCIF                         426
#define TMR0IF                        427
#define PIR1                          428
#define ADIF                          429
#define ADTIF                         430
#define CSWIF                         431
#define OSCFIF                        432
#define PSPIF                         433
#define PIR2                          434
#define C1IF                          435
#define C2IF                          436
#define ZCDIF                         437
#define CMIF                          438
#define HLVDIF                        439
#define PIR3                          440
#define SSP1IF                        441
#define RXBNIF                        442
#define BCL1IF                        443
#define SSP2IF                        444
#define BCL2IF                        445
#define TXBNIF                        446
#define TX1IF                         447
#define RC1IF                         448
#define TX2IF                         449
#define RC2IF                         450
#define PIR4                          451
#define TMR1IF                        452
#define TMR2IF                        453
#define TMR3IF                        454
#define TMR4IF                        455
#define TMR5IF                        456
#define TMR6IF                        457
#define PIR5                          458
#define TMR1GIF                       459
#define TMR3GIF                       460
#define TMR5GIF                       461
#define PIR6                          462
#define CCP1IF                        463
#define CCP2IF                        464
#define PIR7                          465
#define CWGIF                         466
#define CWG1IF                        467
#define NVMIF                         468
#define CRCIF                         469
#define SCANIF                        470
#define WDTCON0                       471
#define WDTCON0_SEN                   472
#define SWDTEN                        473
#define WDTSEN                        474
#define WDTPS                         475
#define WDTPS0                        476
#define WDTPS1                        477
#define WDTPS2                        478
#define WDTPS3                        479
#define WDTPS4                        480
#define WDTCON1                       481
#define WDTWINDOW0                    482
#define WINDOW0                       483
#define WINDOW                        484
#define WDTWINDOW                     485
#define WDTWINDOW1                    486
#define WINDOW1                       487
#define WDTWINDOW2                    488
#define WINDOW2                       489
#define WDTCS                         490
#define WDTCS0                        491
#define WDTCS1                        492
#define WDTCS2                        493
#define WDTPSL                        494
#define WDTPSL_WDTPSCNT               495
#define WDTPSL_PSCNT                  496
#define WDTPSCNT0                     497
#define PSCNT0                        498
#define WDTPSCNT1                     499
#define PSCNT1                        500
#define WDTPSCNT2                     501
#define PSCNT2                        502
#define WDTPSCNT3                     503
#define PSCNT3                        504
#define WDTPSCNT4                     505
#define PSCNT4                        506
#define WDTPSCNT5                     507
#define PSCNT5                        508
#define WDTPSCNT6                     509
#define PSCNT6                        510
#define WDTPSCNT7                     511
#define PSCNT7                        512
#define WDTPSH                        513
#define PSCNT8                        514
#define WDTPSH_WDTPSCNT               515
#define WDTPSH_PSCNT                  516
#define WDTPSCNT8                     517
#define PSCNT9                        518
#define WDTPSCNT9                     519
#define PSCNT10                       520
#define WDTPSCNT10                    521
