tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf27k40_tdd.h
#define PWM3DCL_DC1                   2207
#define PWM3DCH                       2208
#define PWM3DC2                       2209
#define PWM3DCH_DC2                   2210
#define PWM3DCH_DC                    2211
#define PWM3DCH_PWMPW2                2212
#define PWM3DC3                       2213
#define PWM3DCH_DC3                   2214
#define PWM3DCH_PWMPW3                2215
#define PWM3DC4                       2216
#define PWM3DCH_DC4                   2217
#define PWM3DCH_PWMPW4                2218
#define PWM3DC5                       2219
#define PWM3DCH_DC5                   2220
#define PWM3DCH_PWMPW5                2221
#define PWM3DC6                       2222
#define PWM3DCH_DC6                   2223
#define PWM3DCH_PWMPW6                2224
#define PWM3DC7                       2225
#define PWM3DCH_DC7                   2226
#define PWM3DCH_PWMPW7                2227
#define PWM3DC8                       2228
#define PWM3DCH_DC8                   2229
#define PWM3DCH_PWMPW8                2230
#define PWM3DC9                       2231
#define PWM3DCH_DC9                   2232
#define PWM3DCH_PWMPW9                2233
#define PWM3CON                       2234
#define PWM3CON_POL                   2235
#define PWM3POL                       2236
#define PWM3CON_OUT                   2237
#define PWM3OUT                       2238
#define PWM3EN                        2239
#define PWM3CON_EN                    2240
#define CCPR2L                        2241
#define CCPR2L_RL                     2242
#define CCPR2H                        2243
#define CCPR2H_RH                     2244
#define CCP2CON                       2245
#define CCP2MODE                      2246
#define CCP2MODE0                     2247
#define CCP2CON_MODE0                 2248
#define CCP2CON_MODE                  2249
#define CCP2MODE1                     2250
#define CCP2CON_MODE1                 2251
#define CCP2MODE2                     2252
#define CCP2CON_MODE2                 2253
#define CCP2MODE3                     2254
#define CCP2CON_MODE3                 2255
#define CCP2FMT                       2256
#define CCP2CON_FMT                   2257
#define CCP2OUT                       2258
#define CCP2CON_OUT                   2259
#define CCP2EN                        2260
#define CCP2CON_EN                    2261
#define CCP2CAP                       2262
#define CCP2CAP_CTS                   2263
#define CCP2CAP_CTS0                  2264
#define CCP2CTS                       2265
#define CCP2CTS0                      2266
#define CCP2CAP_CTS1                  2267
#define CCP2CTS1                      2268
#define CCPR1L                        2269
#define CCPR1L_RL                     2270
#define CCPR1H                        2271
#define CCPR1H_RH                     2272
#define CCP1CON                       2273
#define CCP1MODE0                     2274
#define CCP1CON_MODE0                 2275
#define CCP1CON_MODE                  2276
#define CCP1MODE                      2277
#define CCP1MODE1                     2278
#define CCP1CON_MODE1                 2279
#define CCP1MODE2                     2280
#define CCP1CON_MODE2                 2281
#define CCP1MODE3                     2282
#define CCP1CON_MODE3                 2283
#define CCP1FMT                       2284
#define CCP1CON_FMT                   2285
#define CCP1CON_OUT                   2286
#define CCP1OUT                       2287
#define CCP1EN                        2288
#define CCP1CON_EN                    2289
#define P1M1                          2290
#define CCP1CAP                       2291
#define CCP1CTS0                      2292
#define CCP1CAP_CTS                   2293
#define CCP1CAP_CTS0                  2294
#define CCP1CTS                       2295
#define CCP1CTS1                      2296
#define CCP1CAP_CTS1                  2297
#define CCPTMRS                       2298
#define C1TSEL0                       2299
#define C1TSEL                        2300
#define C1TSEL1                       2301
#define C2TSEL0                       2302
#define C2TSEL                        2303
#define C2TSEL1                       2304
#define P3TSEL                        2305
#define P3TSEL0                       2306
#define P3TSEL1                       2307
#define P4TSEL0                       2308
#define P4TSEL                        2309
#define P4TSEL1                       2310
#define T6TMR                         2311
#define TMR6                          2312
#define T6PR                          2313
#define PR6                           2314
#define T6CON                         2315
#define T6CON_OUTPS0                  2316
#define T6OUTPS                       2317
#define T6CON_OUTPS                   2318
#define T6OUTPS0                      2319
#define T6CON_OUTPS1                  2320
#define T6OUTPS1                      2321
#define T6CON_OUTPS2                  2322
#define T6OUTPS2                      2323
#define T6CON_OUTPS3                  2324
#define T6OUTPS3                      2325
#define T6CON_CKPS0                   2326
#define T6CKPS                        2327
#define T6CKPS0                       2328
#define T6CON_CKPS                    2329
#define T6CON_CKPS1                   2330
#define T6CKPS1                       2331
#define T6CON_CKPS2                   2332
#define T6CKPS2                       2333
#define TMR6ON                        2334
#define T6ON                          2335
#define T6CON_ON                      2336
#define T6HLT                         2337
#define T6HLT_MODE0                   2338
#define T6HLT_MODE                    2339
#define T6MODE0                       2340
#define T6MODE                        2341
#define T6HLT_MODE1                   2342
#define T6MODE1                       2343
#define T6MODE2                       2344
#define T6HLT_MODE2                   2345
#define T6HLT_MODE3                   2346
#define T6MODE3                       2347
#define T6MODE4                       2348
#define T6HLT_MODE4                   2349
#define T6CKSYNC                      2350
#define T6HLT_CKSYNC                  2351
#define T6CKPOL                       2352
#define T6HLT_CKPOL                   2353
#define T6PSYNC                       2354
#define T6HLT_PSYNC                   2355
#define T6CLKCON                      2356
#define T6CS                          2357
#define T6CS0                         2358
#define T6CS1                         2359
#define T6CS2                         2360
#define T6CS3                         2361
#define T6RST                         2362
#define T6RST_RSEL                    2363
#define T6RST_RSEL0                   2364
#define T6RSEL                        2365
#define T6RSEL0                       2366
#define T6RST_RSEL1                   2367
#define T6RSEL1                       2368
#define T6RSEL2                       2369
#define T6RST_RSEL2                   2370
#define T6RST_RSEL3                   2371
#define T6RSEL3                       2372
#define T4TMR                         2373
#define TMR4                          2374
#define T4PR                          2375
#define PR4                           2376
#define T4CON                         2377
#define T4OUTPS0                      2378
#define T4CON_OUTPS                   2379
#define T4OUTPS                       2380
#define T4CON_OUTPS0                  2381
#define T4OUTPS1                      2382
#define T4CON_OUTPS1                  2383
#define T4CON_OUTPS2                  2384
#define T4OUTPS2                      2385
#define T4OUTPS3                      2386
#define T4CON_OUTPS3                  2387
#define T4CON_CKPS0                   2388
#define T4CKPS0                       2389
#define T4CON_CKPS                    2390
#define T4CKPS                        2391
#define T4CKPS1                       2392
#define T4CON_CKPS1                   2393
#define T4CKPS2                       2394
#define T4CON_CKPS2                   2395
#define T4ON                          2396
#define T4CON_ON                      2397
#define TMR4ON                        2398
#define T4HLT                         2399
#define T4MODE                        2400
#define T4HLT_MODE                    2401
#define T4HLT_MODE0                   2402
#define T4MODE0                       2403
#define T4HLT_MODE1                   2404
#define T4MODE1                       2405
#define T4HLT_MODE2                   2406
#define T4MODE2                       2407
#define T4HLT_MODE3                   2408
#define T4MODE3                       2409
#define T4HLT_MODE4                   2410
#define T4MODE4                       2411
#define T4HLT_CKSYNC                  2412
#define T4CKSYNC                      2413
#define T4HLT_CKPOL                   2414
#define T4CKPOL                       2415
#define T4PSYNC                       2416
#define T4HLT_PSYNC                   2417
#define T4CLKCON                      2418
#define T4CS0                         2419
#define T4CS                          2420
#define T4CS1                         2421
#define T4CS2                         2422
#define T4CS3                         2423
#define T4RST                         2424
#define T4RSEL0                       2425
#define T4RSEL                        2426
#define T4RST_RSEL                    2427
#define T4RST_RSEL0                   2428
#define T4RSEL1                       2429
#define T4RST_RSEL1                   2430
#define T4RSEL2                       2431
#define T4RST_RSEL2                   2432
#define T4RSEL3                       2433
#define T4RST_RSEL3                   2434
#define T2TMR                         2435
#define TMR2                          2436
#define T2PR                          2437
#define PR2                           2438
#define T2CON                         2439
#define T2OUTPS0                      2440
#define T2CON_OUTPS0                  2441
#define T2OUTPS                       2442
#define T2CON_OUTPS                   2443
#define T2OUTPS1                      2444
#define T2CON_OUTPS1                  2445
#define T2OUTPS2                      2446
#define T2CON_OUTPS2                  2447
#define T2OUTPS3                      2448
#define T2CON_OUTPS3                  2449
#define T2CKPS0                       2450
#define T2CON_CKPS                    2451
#define T2CKPS                        2452
#define T2CON_CKPS0                   2453
#define T2CKPS1                       2454
#define T2CON_CKPS1                   2455
#define T2CKPS2                       2456
#define T2CON_CKPS2                   2457
#define T2CON_ON                      2458
#define TMR2ON                        2459
#define T2ON                          2460
#define T2HLT                         2461
#define T2HLT_MODE                    2462
#define T2MODE                        2463
#define T2MODE0                       2464
#define T2HLT_MODE0                   2465
#define T2MODE1                       2466
#define T2HLT_MODE1                   2467
#define T2MODE2                       2468
#define T2HLT_MODE2                   2469
#define T2MODE3                       2470
#define T2HLT_MODE3                   2471
#define T2MODE4                       2472
#define T2HLT_MODE4                   2473
#define T2HLT_CKSYNC                  2474
#define T2CKSYNC                      2475
#define T2HLT_CKPOL                   2476
#define T2CKPOL                       2477
#define T2PSYNC                       2478
#define T2HLT_PSYNC                   2479
#define T2CLKCON                      2480
#define T2CS                          2481
#define T2CS0                         2482
#define T2CS1                         2483
#define T2CS2                         2484
#define T2CS3                         2485
#define T2RST                         2486
#define T2RSEL0                       2487
#define T2RST_RSEL                    2488
#define T2RSEL                        2489
#define T2RST_RSEL0                   2490
#define T2RSEL1                       2491
#define T2RST_RSEL1                   2492
#define T2RST_RSEL2                   2493
#define T2RSEL2                       2494
#define T2RSEL3                       2495
#define T2RST_RSEL3                   2496
#define TMR5L                         2497
#define TMR5L0                        2498
#define TMR5L1                        2499
#define TMR5L2                        2500
#define TMR5L3                        2501
#define TMR5L4                        2502
#define TMR5L5                        2503
#define TMR5L6                        2504
#define TMR5L7                        2505
#define TMR5H0                        2506
#define TMR5H                         2507
#define TMR5H1                        2508
#define TMR5H2                        2509
#define TMR5H3                        2510
#define TMR5H4                        2511
#define TMR5H5                        2512
#define TMR5H6                        2513
#define TMR5H7                        2514
#define T5CON                         2515
#define T5CON_ON                      2516
#define TMR5ON                        2517
#define T5CON_RD16                    2518
#define T5RD16                        2519
#define RD165                         2520
#define nT5SYNC                       2521
#define T5CON_nSYNC                   2522
#define T5CON_NOT_SYNC                2523
#define NOT_T5SYNC                    2524
#define T5CON_CKPS0                   2525
#define T5CON_CKPS                    2526
#define T5CKPS0                       2527
#define T5CON_CKPS1                   2528
#define T5CKPS1                       2529
#define T5GCON                        2530
#define T5GCON_GVAL                   2531
#define T5GVAL                        2532
#define T5GGO_nDONE                   2533
#define T5GCON_GGO_NOT_DONE           2534
#define T5GCON_GGO_nDONE              2535
#define T5GGO_NOT_DONE                2536
#define T5GGO                         2537
#define T5GCON_GSPM                   2538
#define T5GSPM                        2539
#define T5GTM                         2540
#define T5GCON_GTM                    2541
#define T5GPOL                        2542
#define T5GCON_GPOL                   2543
#define T5GCON_GE                     2544
#define T5GE                          2545
#define T5GATE                        2546
#define T5GATE_GSS0                   2547
#define T5GSS0                        2548
#define T5GATE_GSS                    2549
#define T5GATE_GSS1                   2550
#define T5GSS1                        2551
#define T5GATE_GSS2                   2552
#define T5GSS2                        2553
#define T5GATE_GSS3                   2554
#define T5GSS3                        2555
#define T5CLK                         2556
#define T5CS0                         2557
#define T5CLK_CS                      2558
#define T5CLK_CS0                     2559
#define T5CS1                         2560
#define T5CLK_CS1                     2561
#define T5CS2                         2562
#define T5CLK_CS2                     2563
#define T5CS3                         2564
#define T5CLK_CS3                     2565
#define TMR3L0                        2566
#define TMR3L                         2567
#define TMR3L1                        2568
#define TMR3L2                        2569
#define TMR3L3                        2570
#define TMR3L4                        2571
#define TMR3L5                        2572
#define TMR3L6                        2573
#define TMR3L7                        2574
#define TMR3H                         2575
#define TMR3H0                        2576
#define TMR3H1                        2577
#define TMR3H2                        2578
#define TMR3H3                        2579
#define TMR3H4                        2580
#define TMR3H5                        2581
#define TMR3H6                        2582
#define TMR3H7                        2583
#define T3CON                         2584
#define T3CON_ON                      2585
#define TMR3ON                        2586
#define T3CON_RD16                    2587
#define RD163                         2588
#define T3RD16                        2589
#define T3CON_NOT_SYNC                2590
#define T3CON_nSYNC                   2591
#define NOT_T3SYNC                    2592
#define nT3SYNC                       2593
#define T3CKPS0                       2594
#define T3CON_CKPS0                   2595
#define T3CON_CKPS                    2596
#define T3CKPS1                       2597
#define T3CON_CKPS1                   2598
#define T3GCON                        2599
#define T3GVAL                        2600
#define T3GCON_GVAL                   2601
#define T3GGO                         2602
#define T3GGO_NOT_DONE                2603
#define T3GCON_GGO_nDONE              2604
#define T3GGO_nDONE                   2605
#define T3GCON_GGO_NOT_DONE           2606
#define T3GCON_GSPM                   2607
#define T3GSPM                        2608
#define T3GCON_GTM                    2609
#define T3GTM                         2610
#define T3GCON_GPOL                   2611
#define T3GPOL                        2612
#define T3GCON_GE                     2613
#define T3GE                          2614
#define T3GATE                        2615
#define T3GSS0                        2616
#define T3GATE_GSS0                   2617
#define T3GATE_GSS                    2618
#define T3GSS1                        2619
#define T3GATE_GSS1                   2620
#define T3GSS2                        2621
#define T3GATE_GSS2                   2622
#define T3GSS3                        2623
#define T3GATE_GSS3                   2624
#define T3CLK                         2625
#define T3CLK_CS                      2626
#define T3CLK_CS0                     2627
#define T3CS0                         2628
#define T3CLK_CS1                     2629
#define T3CS1                         2630
#define T3CLK_CS2                     2631
#define T3CS2                         2632
#define T3CS3                         2633
#define T3CLK_CS3                     2634
#define TMR1L                         2635
#define TMR1L0                        2636
#define TMR1L1                        2637
#define TMR1L2                        2638
#define TMR1L3                        2639
#define TMR1L4                        2640
#define TMR1L5                        2641
#define TMR1L6                        2642
#define TMR1L7                        2643
#define TMR1H0                        2644
#define TMR1H                         2645
#define TMR1H1                        2646
#define TMR1H2                        2647
#define TMR1H3                        2648
#define TMR1H4                        2649
#define TMR1H5                        2650
#define TMR1H6                        2651
#define TMR1H7                        2652
#define T1CON                         2653
#define TMR1ON                        2654
#define T1CON_ON                      2655
#define T1CON_RD16                    2656
#define T1RD16                        2657
#define NOT_T1SYNC                    2658
#define T1CON_nSYNC                   2659
#define nT1SYNC                       2660
#define T1CON_NOT_SYNC                2661
#define T1CON_CKPS0                   2662
#define T1CKPS0                       2663
#define T1CON_CKPS                    2664
#define T1CKPS1                       2665
#define T1CON_CKPS1                   2666
#define T1GCON                        2667
#define T1GCON_GVAL                   2668
#define T1GVAL                        2669
#define T1GGO_NOT_DONE                2670
#define T1GGO_nDONE                   2671
#define T1GCON_GGO_nDONE              2672
#define T1GCON_GGO_NOT_DONE           2673
#define T1GGO                         2674
#define T1GCON_GSPM                   2675
#define T1GSPM                        2676
#define T1GTM                         2677
#define T1GCON_GTM                    2678
#define T1GPOL                        2679
#define T1GCON_GPOL                   2680
#define T1GCON_GE                     2681
#define T1GE                          2682
#define T1GATE                        2683
#define T1GATE_GSS0                   2684
#define T1GSS0                        2685
#define T1GATE_GSS                    2686
#define T1GATE_GSS1                   2687
#define T1GSS1                        2688
#define T1GSS2                        2689
#define T1GATE_GSS2                   2690
#define T1GSS3                        2691
#define T1GATE_GSS3                   2692
#define T1CLK                         2693
#define T1CS0                         2694
#define T1CLK_CS                      2695
#define T1CLK_CS0                     2696
#define T1CLK_CS1                     2697
#define T1CS1                         2698
#define T1CS2                         2699
#define T1CLK_CS2                     2700
#define T1CS3                         2701
#define T1CLK_CS3                     2702
#define TMR0L0                        2703
#define TMR0L                         2704
#define TMR0L1                        2705
#define TMR0L2                        2706
#define TMR0L3                        2707
#define TMR0L4                        2708
#define TMR0L5                        2709
#define TMR0L6                        2710
#define TMR0L7                        2711
#define TMR0H0                        2712
#define T0PR                          2713
#define TMR0H                         2714
#define T0PR0                         2715
#define TMR0H1                        2716
#define T0PR1                         2717
#define TMR0H2                        2718
#define T0PR2                         2719
#define TMR0H3                        2720
#define T0PR3                         2721
#define TMR0H4                        2722
#define T0PR4                         2723
#define TMR0H5                        2724
#define T0PR5                         2725
#define TMR0H6                        2726
#define T0PR6                         2727
#define TMR0H7                        2728
#define T0PR7                         2729
#define T0CON0                        2730
#define T0OUTPS                       2731
#define T0OUTPS0                      2732
#define T0OUTPS1                      2733
#define T0OUTPS2                      2734
#define T0OUTPS3                      2735
#define T016BIT                       2736
#define T0OUT                         2737
#define T0EN                          2738
#define T0CON1                        2739
#define T0PS                          2740
#define T0CKPS                        2741
#define T0CKPS0                       2742
#define T0PS0                         2743
#define T0CKPS1                       2744
#define T0PS1                         2745
#define T0CKPS2                       2746
#define T0PS2                         2747
#define T0CKPS3                       2748
#define T0PS3                         2749
#define T0ASYNC                       2750
#define T0CS                          2751
#define T0CS0                         2752
#define T0CS1                         2753
#define T0CS2                         2754
#define PCON0                         2755
#define BOR                           2756
#define NOT_BOR                       2757
#define nBOR                          2758
#define POR                           2759
#define nPOR                          2760
#define NOT_POR                       2761
#define nRI                           2762
#define NOT_RI                        2763
#define RI                            2764
