tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf27k40_tdd.h
#define NOT_RMCLR                     2765
#define nRMCLR                        2766
#define RMCLR                         2767
#define NOT_RWDT                      2768
#define nRWDT                         2769
#define RWDT                          2770
#define nWDTWV                        2771
#define WDTWV                         2772
#define NOT_WDTWV                     2773
#define STKUNF                        2774
#define STKOVF                        2775
#define STATUS                        2776
#define C                             2777
#define CARRY                         2778
#define STATUS_DC                     2779
#define ZERO                          2780
#define Z                             2781
#define OV                            2782
#define OVERFLOW                      2783
#define N                             2784
#define NEGATIVE                      2785
#define PD                            2786
#define nPD                           2787
#define NOT_PD                        2788
#define TO                            2789
#define NOT_TO                        2790
#define nTO                           2791
#define FSR2L                         2792
#define PLUSW2                        2793
#define PREINC2                       2794
#define POSTDEC2                      2795
#define POSTINC2                      2796
#define INDF2                         2797
#define FSR1L                         2798
#define PLUSW1                        2799
#define PREINC1                       2800
#define POSTDEC1                      2801
#define POSTINC1                      2802
#define INDF1                         2803
#define WREG                          2804
#define FSR0L                         2805
#define PLUSW0                        2806
#define PREINC0                       2807
#define POSTDEC0                      2808
#define POSTINC0                      2809
#define INDF0                         2810
#define INTCON                        2811
#define INT0EDG                       2812
#define INT1EDG                       2813
#define INT2EDG                       2814
#define IPEN                          2815
#define PEIE                          2816
#define PEIE_GIEL                     2817
#define GIEL                          2818
#define GIE                           2819
#define GIE_GIEH                      2820
#define GIEH                          2821
#define PRODL                         2822
#define PRODH                         2823
#define TABLAT                        2824
#define TBLPTRL                       2825
#define TBLPTRH                       2826
#define TBLPTRU                       2827
#define ACSS                          2828
#define PCL                           2829
#define PCLATH                        2830
#define PCLATH_PCH                    2831
#define PCLATU                        2832
#define PCU                           2833
#define STKPTR0                       2834
#define STKPTR                        2835
#define SP0                           2836
#define STKPTR1                       2837
#define SP1                           2838
#define STKPTR2                       2839
#define SP2                           2840
#define SP3                           2841
#define STKPTR3                       2842
#define STKPTR4                       2843
#define SP4                           2844
#define STKPTR5                       2845
#define SP5                           2846
#define TOSL                          2847
#define TOSH                          2848

#endif // _PIC18LF27K40_H_
